Revit 2027 API
BuiltInFailures.CopyPasteFailures.CantCopyFrom2dTo3dFam Property
 Can't copy 2D element(s) into a 3D family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantCopyFrom2dTo3dFam { get; }
Public Shared ReadOnly Property CantCopyFrom2dTo3dFam As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantCopyFrom2dTo3dFam {
	FailureDefinitionId^ get ();
}
static member CantCopyFrom2dTo3dFam : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace